class ErrorMessages:
    """Класс для хранения сообщений об ошибках"""
    
    # Поля ошибок в ответе
    ERROR_FIELD_DETAIL = "detail"
    ERROR_FIELD_NON_FIELD = "non_field_errors"
    ERROR_FIELD_EMAIL = "email"
    ERROR_FIELD_FIRST_NAME = "first_name"
    ERROR_FIELD_PHONE = "phone_number"
    
    # Сообщения об ошибках существующих пользователей
    USER_EMAIL_EXISTS = "Пользователь с таким email уже существует"
    USER_PHONE_EXISTS = "Пользователь с таким номером телефона уже существует"
    
    # Сообщения валидации форматов
    INVALID_EMAIL = ("Email имеет неверный формат. Проверьте: Используйте только латинские "
                     "буквы, цифры, точку, дефис и нижнее подчёркивание. Локальная часть (до @) от 1 до 64 символов. "
                     "Доменная часть (после @) от 1 до 253 символов. Не допускаются: две точки подряд, точка в начале/конце, "
                     "дефис в конце.")
    INVALID_FIRST_NAME = "Имя должно содержать только буквы, пробелы и тире."
    INVALID_PHONE = "Неверный формат номера телефона."
    
    # Сообщения о пустых полях
    FIELD_CANNOT_BE_EMPTY = "Это поле не может быть пустым."